Autodesk.Revit.DB.RevitLinkInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ImportPlacement)
Creates a new instance of a linked Revit project (RevitLinkType).
Remarks:
Instances will be placed origin-to-origin or by shared coordinates.
This function cannot be used to create instances
of nested links.
document:
The document in which the new instance should be created.
revitLinkTypeId:
The element id of the RevitLinkType.
placement:
The mode where to place the RevitLinkInstance.
Set this option to place the view at the origin or by shared coordinates.
Returns:
The newly-created RevitLinkInstance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revitLinkTypeId isn't a RevitLinkType.
-or-
revitLinkTypeId is not a top-level link.
-or-
revitLinkTypeId is not a loaded RevitLinkType
-or-
document is not a project document.
-or-
placement isn't supported.Only Origin or Shared placement is supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The placement is Shared, and the host model and the link do not share the same coordinate system.
Or the placement is Shared, and the shared coordinates of the host model do not match the GIS coordinate system of the linked file.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.RevitLinkInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new instance of a linked Revit project (RevitLinkType).
Remarks:
Instances will be placed origin-to-origin.
This function cannot be used to create instances
of nested links.
document:
The document in which the new instance should be created.
revitLinkTypeId:
The element id of the RevitLinkType.
Returns:
The newly-created RevitLinkInstance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revitLinkTypeId isn't a RevitLinkType.
-or-
revitLinkTypeId is not a top-level link.
-or-
revitLinkTypeId is not a loaded RevitLinkType
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013